In [10]:
from pyspark.sql import SparkSession

# Create a SparkSession
spark = SparkSession.builder \
    .appName("practice") \
    .getOrCreate()

# Sample data
data = [(1, 24, 'Jhon', 'male'), (2, 30, 'mufa', 'male'),(2, 30, 'mufa', 'male'), (3, 35, 'siri', 'female')]
schema = ['id', 'Age', 'Name', 'Gender']

# Create DataFrame
df = spark.createDataFrame(data, schema)

# Show DataFrame
df.show()

+---+---+----+------+
| id|Age|Name|Gender|
+---+---+----+------+
|  1| 24|Jhon|  male|
|  2| 30|mufa|  male|
|  2| 30|mufa|  male|
|  3| 35|siri|female|
+---+---+----+------+

In [11]:
df.distinct().show()

+---+---+----+------+
| id|Age|Name|Gender|
+---+---+----+------+
|  1| 24|Jhon|  male|
|  2| 30|mufa|  male|
|  3| 35|siri|female|
+---+---+----+------+

In [14]:
df.dropDuplicates(['Gender']).show()

+---+---+----+------+
| id|Age|Name|Gender|
+---+---+----+------+
|  3| 35|siri|female|
|  1| 24|Jhon|  male|
+---+---+----+------+

In [18]:
data = [
    (1, "Alice", 25, 50000),
    
    (4, "Diana", 40, 80000),
    (5, "Edward", 45, 90000),
     (2, "Bob", 30, 60000),
    (3, "Charlie", 35, 70000)
]
columns = ["id", "name", "age", "salary"]

df = spark.createDataFrame(data, schema=columns)

df.show()

+---+-------+---+------+
| id|   name|age|salary|
+---+-------+---+------+
|  1|  Alice| 25| 50000|
|  4|  Diana| 40| 80000|
|  5| Edward| 45| 90000|
|  2|    Bob| 30| 60000|
|  3|Charlie| 35| 70000|
+---+-------+---+------+

In [21]:
df.sort('name').show()

+---+-------+---+------+
| id|   name|age|salary|
+---+-------+---+------+
|  1|  Alice| 25| 50000|
|  2|    Bob| 30| 60000|
|  3|Charlie| 35| 70000|
|  4|  Diana| 40| 80000|
|  5| Edward| 45| 90000|
+---+-------+---+------+

In [22]:
df.orderBy('name').show()

+---+-------+---+------+
| id|   name|age|salary|
+---+-------+---+------+
|  1|  Alice| 25| 50000|
|  2|    Bob| 30| 60000|
|  3|Charlie| 35| 70000|
|  4|  Diana| 40| 80000|
|  5| Edward| 45| 90000|
+---+-------+---+------+

In [24]:
from pyspark.sql.functions import col

# Sorting by id in descending order
df.sort(col("id").desc()).show()

+---+-------+---+------+
| id|   name|age|salary|
+---+-------+---+------+
|  5| Edward| 45| 90000|
|  4|  Diana| 40| 80000|
|  3|Charlie| 35| 70000|
|  2|    Bob| 30| 60000|
|  1|  Alice| 25| 50000|
+---+-------+---+------+

In [26]:
df.sort(df.salary.desc(),df.age.desc()).show()

+---+-------+---+------+
| id|   name|age|salary|
+---+-------+---+------+
|  5| Edward| 45| 90000|
|  4|  Diana| 40| 80000|
|  3|Charlie| 35| 70000|
|  2|    Bob| 30| 60000|
|  1|  Alice| 25| 50000|
+---+-------+---+------+

In [43]:
#first dataframe
data1 = [
    (1, "Alice", 25, 50000,'M','IT'),
    (2, "Bob", 30, 60000,'M','Sales'),
    (4, "Diana", 40, 80000,'F','IT'),
    (3, "Charlie", 35, 70000,'F','Sales')
]

# 2nd dataframe
data2 = [
    (4, "Diana", 40, 80000,'F','storage'),
    (5, "Edward", 45, 90000,'M','IT'),
    (6, "Frank", 50, 100000,'M','storage')
]

columns = ["id", "name", "age", "salary","gender","dep"]

df1 = spark.createDataFrame(data1, schema=columns)

df2 = spark.createDataFrame(data2, schema=columns)

# Show the DataFrames
print("DataFrame 1:")
df1.show()

print("DataFrame 2:")
df2.show()

DataFrame 1:
+---+-------+---+------+------+-----+
| id|   name|age|salary|gender|  dep|
+---+-------+---+------+------+-----+
|  1|  Alice| 25| 50000|     M|   IT|
|  2|    Bob| 30| 60000|     M|Sales|
|  4|  Diana| 40| 80000|     F|   IT|
|  3|Charlie| 35| 70000|     F|Sales|
+---+-------+---+------+------+-----+

DataFrame 2:
+---+------+---+------+------+-------+
| id|  name|age|salary|gender|    dep|
+---+------+---+------+------+-------+
|  4| Diana| 40| 80000|     F|storage|
|  5|Edward| 45| 90000|     M|     IT|
|  6| Frank| 50|100000|     M|storage|
+---+------+---+------+------+-------+

In [44]:
newdf = df1.union(df2)

In [45]:
newdf.show()

+---+-------+---+------+------+-------+
| id|   name|age|salary|gender|    dep|
+---+-------+---+------+------+-------+
|  1|  Alice| 25| 50000|     M|     IT|
|  2|    Bob| 30| 60000|     M|  Sales|
|  4|  Diana| 40| 80000|     F|     IT|
|  3|Charlie| 35| 70000|     F|  Sales|
|  4|  Diana| 40| 80000|     F|storage|
|  5| Edward| 45| 90000|     M|     IT|
|  6|  Frank| 50|100000|     M|storage|
+---+-------+---+------+------+-------+

In [49]:
new=newdf.groupBy('dep','gender').count()
new.show()

+-------+------+-----+
|    dep|gender|count|
+-------+------+-----+
|     IT|     M|    2|
|  Sales|     M|    1|
|     IT|     F|    1|
|  Sales|     F|    1|
|storage|     F|    1|
|storage|     M|    1|
+-------+------+-----+

In [52]:
data1 = [
    (1, "Alice", 25, 50000,'M','IT'),
    (2, "Bob", 30, 60000,'M','Sales'),
    
    (3, "Charlie", 35, 70000,'F','Sales'),
    (4, "Diana", 40, 80000,'F','storage'),
    (5, "Edward", 45, 90000,'M','IT'),
    (6, "Frank", 50, 100000,'M','storage')]
columns = ["id", "name", "age", "salary","gender","dep"]

In [53]:
df= spark.createDataFrame(data1, schema=columns)

In [54]:
df.show()

+---+-------+---+------+------+-------+
| id|   name|age|salary|gender|    dep|
+---+-------+---+------+------+-------+
|  1|  Alice| 25| 50000|     M|     IT|
|  2|    Bob| 30| 60000|     M|  Sales|
|  3|Charlie| 35| 70000|     F|  Sales|
|  4|  Diana| 40| 80000|     F|storage|
|  5| Edward| 45| 90000|     M|     IT|
|  6|  Frank| 50|100000|     M|storage|
+---+-------+---+------+------+-------+

In [62]:
group_df=df.groupBy('dep').count()
group_df.show()

+-------+-----+
|    dep|count|
+-------+-----+
|     IT|    2|
|  Sales|    2|
|storage|    2|
+-------+-----+

In [64]:
group_df1 = df.groupBy('gender').count()
group_df1.show()

+------+-----+
|gender|count|
+------+-----+
|     M|    4|
|     F|    2|
+------+-----+

In [66]:
#join
datal = [
    (1, 'maheer', 2000, 2),
    (2, 'wafa', 3000, 1),
    (3, 'abcd', 1000, 4)
]
schemal = ['id', 'name', 'salary', 'dep']

# Data for the department DataFrame
data2 = [
    (1, 'IT'),
    (2, 'HR'),
    (3, 'Payroll')
]
schema2 = ['id', 'name']

empDf = spark.createDataFrame(datal, schemal)
depDf = spark.createDataFrame(data2, schema2)


print("Employee DataFrame:")
empDf.show()

print("Department DataFrame:")
depDf.show()

Employee DataFrame:
+---+------+------+---+
| id|  name|salary|dep|
+---+------+------+---+
|  1|maheer|  2000|  2|
|  2|  wafa|  3000|  1|
|  3|  abcd|  1000|  4|
+---+------+------+---+

Department DataFrame:
+---+-------+
| id|   name|
+---+-------+
|  1|     IT|
|  2|     HR|
|  3|Payroll|
+---+-------+

In [68]:
empDf.join(depDf,empDf.dep ==depDf.id,'inner').show()

+---+------+------+---+---+----+
| id|  name|salary|dep| id|name|
+---+------+------+---+---+----+
|  2|  wafa|  3000|  1|  1|  IT|
|  1|maheer|  2000|  2|  2|  HR|
+---+------+------+---+---+----+

In [71]:
empDf.join(depDf,empDf.dep ==depDf.id,'left').show()

+---+------+------+---+----+----+
| id|  name|salary|dep|  id|name|
+---+------+------+---+----+----+
|  1|maheer|  2000|  2|   2|  HR|
|  2|  wafa|  3000|  1|   1|  IT|
|  3|  abcd|  1000|  4|NULL|NULL|
+---+------+------+---+----+----+

In [72]:
empDf.join(depDf,empDf.dep ==depDf.id,'right').show()

+----+------+------+----+---+-------+
|  id|  name|salary| dep| id|   name|
+----+------+------+----+---+-------+
|   2|  wafa|  3000|   1|  1|     IT|
|   1|maheer|  2000|   2|  2|     HR|
|NULL|  NULL|  NULL|NULL|  3|Payroll|
+----+------+------+----+---+-------+

In [73]:
empDf.join(depDf,empDf.dep ==depDf.id,'full').show()

+----+------+------+----+----+-------+
|  id|  name|salary| dep|  id|   name|
+----+------+------+----+----+-------+
|   2|  wafa|  3000|   1|   1|     IT|
|   1|maheer|  2000|   2|   2|     HR|
|NULL|  NULL|  NULL|NULL|   3|Payroll|
|   3|  abcd|  1000|   4|NULL|   NULL|
+----+------+------+----+----+-------+

In [74]:
#pivot
data = [
    (1, 'maheer', 'male', 'IT'),
    (2, 'wafa', 'male', 'IT'),
    (3, 'asi', 'female', 'HR'),
    (4, 'annu', 'female', 'IT'),
    (5, 'shakti', 'female', 'IT'),
    (6, 'pradeep', 'male', 'HR'),
    (7, 'sarfaraj', 'male', 'HR'),
    (8, 'ayesha', 'female', 'IT')
]

schema = ['id', 'name', 'gender', 'dep']

df = spark.createDataFrame(data, schema)

df.show()

+---+--------+------+---+
| id|    name|gender|dep|
+---+--------+------+---+
|  1|  maheer|  male| IT|
|  2|    wafa|  male| IT|
|  3|     asi|female| HR|
|  4|    annu|female| IT|
|  5|  shakti|female| IT|
|  6| pradeep|  male| HR|
|  7|sarfaraj|  male| HR|
|  8|  ayesha|female| IT|
+---+--------+------+---+

In [76]:
df.groupBy('dep','gender').count().show()

+---+------+-----+
|dep|gender|count|
+---+------+-----+
| IT|  male|    2|
| HR|female|    1|
| IT|female|    3|
| HR|  male|    2|
+---+------+-----+

In [82]:
#implementing pivot on gender
n1 = df.groupBy('dep').pivot('gender').count().show()

+---+------+----+
|dep|female|male|
+---+------+----+
| HR|     1|   2|
| IT|     3|   2|
+---+------+----+

In [84]:
df.groupBy('dep').pivot('gender',['male']).count().show()

+---+----+
|dep|male|
+---+----+
| HR|   2|
| IT|   2|
+---+----+

In [88]:
#unpivot
data = [
    ("HR", 1, 2),
    ("IT", 3, 2)
]
schema = ["dep", "female", "male"]
df = spark.createDataFrame(data, schema)

# Unpivot male and female
unpivot_df = df.selectExpr(
    "dep",
    "stack(2, 'female', female, 'male', male) as (gender, count)"
)

# Show the result
unpivot_df.show()

+---+------+-----+
|dep|gender|count|
+---+------+-----+
| HR|female|    1|
| HR|  male|    2|
| IT|female|    3|
| IT|  male|    2|
+---+------+-----+